---
type: BIMExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# BIMExportOptions

`Autodesk.Revit.DB.BIMExportOptions` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ViewId | 2021.1 | `public ElementId ViewId { get ; set ; }` |